DenyaS/Lira/Test_CNC/src/stm32f10x_it_iz_STM_V.c
/**
  ******************************************************************************
  * @file    src/stm32f10x_it.c 
  * @author  SDK-SYSTEMS
  * @version V1.0.1
  * @date    SEP-2013
  * @brief   Main Interrupt Service Routines.
  *          This file provides template for all exceptions handler and peripherals
  *          interrupt service routine.
  ******************************************************************************
  * @copy
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2013 SDK-SYSTEMS ODESSA </center></h2>
  */ 

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x_it.h"
#include "stm32f10x_spi.h"
#include "stm32f10x_usart.h"
#include "includes.h"

void TimingDelay_Decrement(void);
/** @addtogroup Demo
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
  uint8_t Sen1_state;
  uint8_t Sen1_old_state = 0;
  uint8_t Sen2_state;
  uint8_t Sen2_old_state = 0;
  uint8_t Sen3_state;
  uint8_t Sen3_old_state = 0;
  uint8_t Sen4_state;
  uint8_t Sen4_old_state = 0;

  /* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/******************************************************************************/
/*            Cortex-M3 Processor Exceptions Handlers                         */
/******************************************************************************/

/**
  * @brief  This function handles NMI exception.
  * @param  None
  * @retval None
  */
void NMI_Handler(void)
{
}

/**
  * @brief  This function handles Hard Fault exception.
  * @param  None
  * @retval None
  */
void HardFault_Handler(void)
{
  /* Go to infinite loop when Hard Fault exception occurs */
  while (1)
  {
  }
}

/**
  * @brief  This function handles Memory Manage exception.
  * @param  None
  * @retval None
  */
void MemManage_Handler(void)
{
  /* Go to infinite loop when Memory Manage exception occurs */
  while (1)
  {
  }
}

/**
  * @brief  This function handles Bus Fault exception.
  * @param  None
  * @retval None
  */
void BusFault_Handler(void)
{
  /* Go to infinite loop when Bus Fault exception occurs */
  while (1)
  {
  }
}

/**
  * @brief  This function handles Usage Fault exception.
  * @param  None
  * @retval None
  */
void UsageFault_Handler(void)
{
  /* Go to infinite loop when Usage Fault exception occurs */
  while (1)
  {
  }
}

/**
  * @brief  This function handles SVCall exception.
  * @param  None
  * @retval None
  */
void SVC_Handler(void)
{
}

/**
  * @brief  This function handles Debug Monitor exception.
  * @param  None
  * @retval None
  */
void DebugMon_Handler(void)
{
}

/**
  * @brief  This function handles PendSV_Handler exception.
  * @param  None
  * @retval None
  */
void PendSV_Handler(void)
{
}

/**
  * @brief  This function handles SysTick Handler.
  * @param  None
  * @retval None
  */
void SysTick_Handler(void)
{
  TimingDelay_Decrement();
  TickCnt++;        // Считаем тики
}

/** [duke] 
  * @brief      Обработчик прерывания базового таймера TIM6
  *                 ==Контраст LCD==
  *                 ==UART0==
  *                 ==UART1==
  * @param      None
  * @retval     None
  */
void TIM6_DAC_IRQHandler(void)
{
  // Disable general interrupts
  //disableInterrupts();  

  // Так как этот обработчик вызывается и для ЦАП, нужно проверять,
  // произошло ли прерывание по переполнению счётчика таймера TIM6.
  if (TIM_GetITStatus(TIM6, TIM_IT_Update) != RESET)
  {
    // Очищаем бит обрабатываемого прерывания
    TIM_ClearITPendingBit(TIM6, TIM_IT_Update);

    // Инвертиреум состояние вывода V0 (контрастность LCD MTC-S16204 
    GPIO_Write(MTC_GPIO_PORT_V0, GPIO_ReadOutputData(MTC_GPIO_PORT_V0) ^ MTC_V0);
  }
    
  // Enable general interrupts
  //enableInterrupts();   
}


/** [duke] 
  * @brief      Обработчик прерывания базового таймера TIM7
  *                 ==Клавиатура==
  *                 ==Датчики==
  * @param      None
  * @retval     None
  */
void TIM7_IRQHandler(void)
{
  uint16_t d;
  uint8_t e;

  // Disable general interrupts
  //disableInterrupts();  

  // Проверка, произошло ли прерывание по переполнению счётчика таймера TIM7.
  if (TIM_GetITStatus(TIM7, TIM_IT_Update) != RESET)
  {
    // Очищаем бит обрабатываемого прерывания
    TIM_ClearITPendingBit(TIM7, TIM_IT_Update);
    
    //======================= Обработка клавиатуры =============================
    if (TimerKeyboard == 0x00) { 
      //d = GPIO_ReadInputData(KEYBOARD_GPIO_PORT) & 0x00f0;
      /** Внимание! Не работает PB4 - Button "UP":
      ошибочное использование задействованного в плате STM32VLD порта PB4*/
      d = GPIO_ReadInputData(KEYBOARD_GPIO_PORT) & 0x00e0;
      // Отдельно - обработка кнопки [UP] (т.к. ошибся в схеме)
      e = GPIO_ReadInputDataBit(GPIOC, KEY_UP);
      if(d) {
        // Включаем на 5 сек подсветку дисплея
        STimerBacklight = 5;
        if(!fl_KeyOn) { // klavisha ne byla najata
          fl_KeyOn = 1; 
          PreviKey = d; 
          TimerKeyboard = 5;   // время удержания клавиши
        }
        else {
          if(PreviKey == d) { // klavisha eshe najata
            if (!fl_KeyFixed) { 
              LastKey = d;
              fl_KeyFixed = 1;
            }
            TimerKeyboard = 10;    // vremya na otpuskanie klavishi
          } 
          else { // uspeli najat' druguyu klavishu
            PreviKey = d;           
            TimerKeyboard = 1;     
          }
        }
      } 
      else if (!d && !e) {
        fl_KeyOn = 0; 
        fl_KeyFixed = 0;
      }
      /* ----- Отдельно - обработка кнопки [UP] (т.к. ошибся в схеме) ------ */
      if(e) {
        // Включаем на 5 сек подсветку дисплея
        STimerBacklight = 5;
        if(!fl_KeyOn) { // klavisha ne byla najata
          fl_KeyOn = 1; 
          PreviKey = UP; 
          TimerKeyboard = 5;   // время удержания клавиши
        }
        else {
          if(PreviKey == UP) { // klavisha eshe najata
            if (!fl_KeyFixed) { 
              LastKey = UP;
              fl_KeyFixed = 1;
            }
            TimerKeyboard = 10;    // vremya na otpuskanie klavishi
          } 
        }
      } 
      /* -------------------------------------------------------------- */
    }
    
