DenyaS/Lira/Test_CNC/src/stm32f10x_it_iz_STM_V.c
    //====================== Обработка датчиков ===============================
    // Обработка датчика Sen1 
    Sen1_state = SEN_1_STATE;
    if ((Sen1_state == 1) && (Sen1_old_state == 0)) {
      // Нажата кнопка "Открыть переднюю дверь"
      fl_OpenFrontDoor = 1;
    }
    Sen1_old_state = Sen1_state;

    // Обработка датчика Sen2 
    Sen2_state = SEN_2_STATE;
    if ((Sen2_state == 1) && (Sen2_old_state == 0)) {
      // Нажата кнопка "Открыть заднюю дверь"
      fl_OpenRearDoor = 1;
    }
    Sen2_old_state = Sen2_state;
    
    // Обработка датчика Sen3 
    Sen3_state = SEN_3_STATE;
    if ((Sen3_state == 1) && (Sen3_old_state == 0)) {
      // Сработал датчик открытия двери
      fl_OpenCar = 1;
    }
    Sen3_old_state = Sen3_state;
      
    // Обработка датчика Sen4 
    Sen4_state = SEN_4_STATE;
    if ((Sen4_state == 1) && (Sen4_old_state == 0)) {
      // ...
      _NOP();
    }
    Sen4_old_state = Sen4_state;
  }
  
  // Enable general interrupts
  //enableInterrupts();   
}

/** [duke] 
  * @brief      Обработчик прерываний от SPI1
  * @param      None
  * @retval     None
  */
void SPI1_IRQHandler (void) 
{
  // Disable general interrupts
  //disableInterrupts();  

  if (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == SET) 
  { // Прерывание вызвано передачей байта ?
    _NOP(); // ... Делаем что надо
    // Clear the SPIx CRC Error flag
    SPI_I2S_ClearFlag(SPI1, SPI_I2S_FLAG_TXE);
  }
  
  if (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) == SET) 
  { // Прерывание вызвано приемом байта ?
    //data_SPI = SPI1->DR; // Читаем то что пришло
    _NOP(); // ... Делаем что надо
    //SPI1->DR = data_SPI; // И отправляем обратно то что приняли
    // Clear the SPIx CRC Error flag
    SPI_I2S_ClearFlag(SPI1, SPI_I2S_FLAG_RXNE);
  }

  /*
  if (SPI_I2S_GetITStatus(SPI1, SPI_I2S_IT_TXE) == SET) 
  { // Прерывание вызвано передачей байта ?
    _NOP(); // ... Делаем что надо
    // Clear the SPIx CRC Error flag
    SPI_I2S_ClearITPendingBit(SPI1, SPI_I2S_IT_TXE);
  }

  if (SPI_I2S_GetITStatus(SPI1, SPI_I2S_IT_RXNE) == SET) 
  { // Прерывание вызвано приемом байта ?
    _NOP(); // ... Делаем что надо
    // Clear the SPIx CRC Error flag
    SPI_I2S_ClearITPendingBit(SPI1, SPI_I2S_IT_RXNE);
  }
  */
  // Enable general interrupts
  //enableInterrupts();   
}

/** [duke] 
  * @brief      Обработчик прерываний UART0
  * @param      None
  * @retval     None
  */
void USART1_IRQHandler (void) 
{
  uchar c;
  
  // Disable general interrupts
  disableInterrupts(); //====DEBUG HANG====
  
  //---------- Прерывание по завершению передачи байта UART0 (USART1) -----------
  if(USART_GetITStatus(USART1, USART_IT_TC) == SET)  
  { // Байт готов к передаче (Transmission complete interrupt)
    if(UARTx[0].SendPack)
    {
      if(UARTx[0].TxCnt) 
      { // Весь пакет ещё не передан
#ifdef __BYTESTUFFING__ // Обработка байтстаффинга на передачу
// При передаче байт 0x7e заменяется на последовательность 0x7d 0x5e
// а байт 0x7d заменяется на последовательность 0x7d 0x5d
        if(fl_ByteStuf) 			
        {	
          fl_ByteStuf = 0;			            // Сбрасываем флаг байтстаффинга
          USART1->DR = *UARTx[0].Ptr++ ^ 0x20;	// Накладываем на передаваемый байт маску XOR, 
                                                // Получаем из 0x7e -> 0x5e, из 0x7d -> 0x5d
                                                // Сдвигаем указатель [Ptr]
          UARTx[0].TxCnt--;                     // Уменьшаем счётчик передаваемых байт [TxCnt]
          goto complete;						// Конец передачи байта			
        } 
        else 
        { 
          if((*UARTx[0].Ptr == 0x7e) || (*UARTx[0].Ptr == 0x7d))  // если хотим передать байт 0x7e или 0x7d
          {
            fl_ByteStuf = 1;		// Выставляем флаг байстаффинга
            USART1->DR = 0x7d;		// и подменяем символ на 0x7d
                                    // счётчик байт не меняем, указатель не сдвигаем 
			goto complete;          // выход - берем опять этот же символ
          } 
        }
#endif  // Конец обработки байтстаффинга на передачу
        UARTx[0].TxCnt--;				// Декрементируем счетчик байт для выходного пакета
		USART1->DR = *UARTx[0].Ptr++;	// Записываем в регистр [DR] передаваемый байт
                                        // Сдвигаем указатель [Ptr]      
      }
      else
      { // Пакет передан 
        UARTx[0].SendPack = 0;
      }
    }
  } //---- передача байта завершена ----

  //---------- Прерывание по завершению приёма байта UART0 (USART1) -----------
  if(USART_GetITStatus(USART1, USART_IT_RXNE) == SET)
  { // Receive Data register not empty interrupt
	//c = USART1->DR;						// Читаем символ из регистра
    c = USART_ReceiveData(USART1);
	if(UARTx[0].RxComplete) { goto complete; }
	if(UARTx[0].ReceivePack) 
    { // Прием пакета не окончен
      UARTx[0].Timer = 20;     // 20 ms
#ifdef __BYTESTUFFING__  // Обработка байтстаффинга по приёму
// При приёме последовательность 0x7d 0x5e заменяется на байт 0x7e
// а последовательность 0x7d 0x5d заменяется на байт 0x7d
      if(fl_ByteStuf)			// Если установлен флаг байтстаффинга 
      {
        fl_ByteStuf = 0;	    // то сбрасываем его
		c = c ^ 0x20;		    // накладываем на принятый байт маску XOR
                                // и получаем из 0x5e -> 0x7e, из 0x5d -> 0x7d
      } 
      else 
      {
        if(c == 0x7d)		    // если получен байт 0x7d, то начинаем обработку байтстафиинга
		{ 
          fl_ByteStuf = 1;	    // устанавливаем флаг байтстаффинга
          goto complete;		// и выходим - этот байт больше не обрабатывается
								// следующий будет либо 0x5e, либо 0x5d
		}
      }
#endif  // Конец обработки байтстаффинга по приёму
      // Длина пакета = размер данных (содержится в байте 2) + 
      // + ADR_DST + ADR_SRC + SIZE + CMD + 2 байта CRC16
      if(UARTx[0].RxCnt == 2) { UARTx[0].RxSize = c + 6; }  
      if(UARTx[0].RxSize >= UART_BUF_SIZE) 
      { // Если размер пакета превышает размер буфера
        //UARTx[0].ReceivePack = 0;		// Заканчиваем приём
		UARTx[0].Timer = 0;
      }
      UARTx[0].InBuf[UARTx[0].RxCnt++] = c;     // Увеличиваем RxCnt
      if(UARTx[0].RxCnt >= UARTx[0].RxSize) 
      {
        //UARTx[0].ReceivePack = 0;		// Заканчиваем приём пакета
        //UARTx[0].RxComplete = 1;
        UARTx[0].Timer = 0;
      }
	} 
    else 
    { // Получен флаг начала пакета - начинаем принимать новый пакет
      if(c == FLAG_PACKET) 
      {
        UARTx[0].ReceivePack = 1;					
		UARTx[0].RxSize	= HEAD_PACKET;          
		UARTx[0].RxCnt = 0;
		UARTx[0].Timer = 20;       // 20 ms
      }
	}
    if (UARTx[0].Timer == 0) {
      UARTx[0].ReceivePack = 0;		// Заканчиваем приём пакета
      UARTx[0].RxComplete = 1;      // Пакет принят
      checkPacket_UARTx(0);
    }
  } //---- приём байта завершен ----

complete:   
  // Сбрасываем бит прерывания TC (бит RXNE сбрасывается после чтения Data Register)
  USART_ClearITPendingBit(USART1, USART_IT_TC);        
    
  // Enable general interrupts
  enableInterrupts();   //====DEBUG HANG====
}

/** [duke] 
  * @brief      Обработчик прерываний UART1
  * @param      None
  * @retval     None
  */
void USART2_IRQHandler (void) 
{
  uchar c;
  
  // Disable general interrupts
  disableInterrupts();  //====DEBUG HANG====
  
