DenyaS/Lira/Test_CNC/src/stm32f10x_it_iz_STM_V.c
  //---------- Прерывание по завершению передачи байта -----------
  if(USART_GetITStatus(USART2, USART_IT_TC) == SET)  
  { 
    if(UARTx[1].SendPack)
    {
      if(UARTx[1].TxCnt) 
      { 
#ifdef __BYTESTUFFING__ 
        if(fl_ByteStuf) 			
        {	
          fl_ByteStuf = 0;			            
          USART2->DR = *UARTx[1].Ptr++ ^ 0x20;	 
          UARTx[1].TxCnt--;                     
          goto complete;									
        } 
        else 
        { 
          if((*UARTx[1].Ptr == 0x7e) || (*UARTx[1].Ptr == 0x7d))  
          {
            fl_ByteStuf = 1;		
            USART2->DR = 0x7d;		
			goto complete;          
          } 
        }
#endif  // Конец обработки байтстаффинга на передачу
        UARTx[1].TxCnt--;				
		USART2->DR = *UARTx[1].Ptr++;	
      }
      else
      { // Пакет передан 
        UARTx[1].SendPack = 0;
        off(TX485);           // Выключили передатчик RS-485  
      }
    }
  } //---- передача байта завершена ----

  //---------- Прерывание по завершению приёма байта UART1 (USART2) -----------
  if(USART_GetITStatus(USART2, USART_IT_RXNE) == SET)
  { 
    c = USART_ReceiveData(USART2);
	if(UARTx[1].RxComplete) { goto complete; }
	if(UARTx[1].ReceivePack) 
    { // Прием пакета не окончен
      UARTx[1].Timer = 20;     
#ifdef __BYTESTUFFING__  // Обработка байтстаффинга по приёму
      if(fl_ByteStuf)			 
      {
        fl_ByteStuf = 0;	    
		c = c ^ 0x20;		    
      } 
      else 
      {
        if(c == 0x7d)		    
		{ 
          fl_ByteStuf = 1;	    
          goto complete;		
		}
      }
#endif  // Конец обработки байтстаффинга по приёму
      if(UARTx[1].RxCnt == 2) { UARTx[1].RxSize = c + 6; }  
      if(UARTx[1].RxSize >= UART_BUF_SIZE) 
      { // Если размер пакета превышает размер буфера
		UARTx[1].Timer = 0;
      }
      UARTx[1].InBuf[UARTx[1].RxCnt++] = c;     // Увеличиваем RxCnt
      if(UARTx[1].RxCnt >= UARTx[1].RxSize) 
      {
        UARTx[1].Timer = 0;
      }
	} 
    else 
    { 
      if(c == FLAG_PACKET) 
      {
        UARTx[1].ReceivePack = 1;					
		UARTx[1].RxSize	= HEAD_PACKET;          
		UARTx[1].RxCnt = 0;
		UARTx[1].Timer = 20;       // 20 ms
      }
	}
    if (UARTx[1].Timer == 0) {
      UARTx[1].ReceivePack = 0;		// Заканчиваем приём пакета
      UARTx[1].RxComplete = 1;      // Пакет принят
      checkPacket_UARTx(1);
    }
  } //---- приём байта завершен ----

complete:   
  // Сбрасываем бит прерывания TC (бит RXNE сбрасывается после чтения Data Register)
  USART_ClearITPendingBit(USART2, USART_IT_TC);        

  // Enable general interrupts
  enableInterrupts();   //====DEBUG HANG====
}

/** [duke] 
  * @brief      Обработчик прерываний I2C1
  * @param      None
  * @retval     None
  */
void I2C1_EV_IRQHandler (void)
{
  /*
  // Disable general interrupts
  disableInterrupts();

  // Enable general interrupts
  enableInterrupts();
  */
}

/**
  * @brief  This function handles External lines 5-9 interrupt request.
  *         Line8 - interrupt from Radio MRF49XA
  * @param  None
  * @retval None
  */
void EXTI9_5_IRQHandler(void)
{

  // Disable general interrupts
  disableInterrupts();  //====DEBUG HANG====

  uchar Bt;
  /* Внешнее прерывание от радиомодуля MRF49XA (Line 8) */
  if(EXTI_GetITStatus(RF_EXTI_LINE) != RESET)
  {
    ENABLE_RF();      // CS active
    
    // Включаем светодиод
    on(LED_RF);
    GPIO_ResetBits(OUTPUTS_GPIO_PORT, LED_WORK);

    // ==== DEBUG ====
    //getRadioStatus(CS_YES);
    //if (RF.STSREG.TXRXFIFO)
    if (GPIO_ReadInputDataBit(RSDO) == 1)
    { // Режим передачи: Регистр передатчика готов к приёму следующего байта для передачи
      // Режим приёма: Есть принятые данные в FIFO, читаем байт из FIFO
      if (Radio.TransmitMode)
      {
//------------------ Режим передачи ---------------------------
        if(Radio.TxCnt < Radio.TxLen) 
        { // не все байты пакета ещё переданы
          RF.TXBREG.TXDB = Radio.TxBuf[Radio.TxCnt++];
          sendData_MRF49XA(RF.TXBREG.HalfWord, CS_YES);
        }
        else { // Все байты пакета переданы
          Radio.Transmit = 0;
          setRadioMode(RECEIVE);      // Устанавливаем режим приёма
        }  
      }
//------------------ Режим приема -----------------------------
      else          // Radio.TransmitMode == 0
      {
        Bt = readFIFO_MRF49XA();
        if (Radio.Receive) { // Пакет принимается
          if(Radio.RxCnt < Radio.RxLen) { // Есть ещё не вычитанные байты
            Radio.RxBuf[Radio.RxCnt++] = Bt;  // Записываем принятый байт в буфер
          }                                   // Инкрементируем счётчик байт
          else {  // Все байты пакета вычитаны
            Radio.Receive = 0;				// Завершаем приём пакета
            Radio.ReceiveComplete = 1;		// Пакет принят
            // Запрещаем FIFO
            sendCommand_MRF49XA(RF.FIFORSTREG.HalfWord);
            // ==== DEBUG ====
            // Проверка принятого пакета   
            checkPacket_MRF49XA();
            NumsOfIPackets++;
            //================
          }
        }
        else { // Пакет ещё не начинал приниматься 
          if (Bt <= DATASIZE) { // Читаем первый байт пакета (DSize)
            Radio.DisChange = 1;
            Radio.Receive = 1;		// Устанавливаем флаг приёма пакета
            Radio.RxLen = (uint)Bt + sizeof(PackHeader_TypeDef) + 2; // Считаем количество байт в пакете
            Radio.RxCnt = 0;
            Radio.RxBuf[Radio.RxCnt++] = Bt; // Записываем в буфер и инкрементируем счётчик
          }
          else { // Неверное значение размера поля данных пакета
            Radio.DisChange = 0;
            sendCommand_MRF49XA(RF.FIFORSTREG.HalfWord);  // Запрет FIFO
            RF_SYNC_RESTART();        // Перезапускаем детектор синхропоследовательности
          }
        }
      }
    }
    else {    // Радиомодуль не готов ни к приёму, ни к передаче
      DISABLE_RF();
    }
    // Прерывание от MRF49XA закончено: байт принят или передан   
    getRadioStatus(CS_YES);

    // Выключаем светодиод
    off(LED_RF);
    GPIO_SetBits(OUTPUTS_GPIO_PORT, LED_WORK);

    // Clear the RF_IRO EXTI line pending bit 
    EXTI_ClearITPendingBit(RF_EXTI_LINE);
  }

  // Enable general interrupts
  enableInterrupts();   //====DEBUG HANG====
}
        
/******************************************************************************/
/*                 STM32F10x Peripherals Interrupt Handlers                   */
/*  Add here the Interrupt Handler for the used peripheral(s) (PPP), for the  */
/*  available peripheral interrupt handler's name please refer to the startup */
/*  file (startup_stm32f10x_xx.s).                                            */
/******************************************************************************/

/**
  * @brief  This function handles PPP interrupt request.
  * @param  None
  * @retval None
  */
/*void PPP_IRQHandler(void)
{
}*/


/**
  * @}
  */ 


/**
  * @brief  Черновик - прерывания от микросхемы MRF49XA
  */ 
/*
// Внешнее прерывание от радиомодуля MRF49XA (Line 8) 
  if(EXTI_GetITStatus(RF_EXTI_LINE) != RESET)
  {

	// Если нет сигнала прерывания на входе - выход
    if (!signal(IRQ, I)) goto exticomplete; // зачем? если мы сюда попали, значит сигнал был
	// Читаем регистр статуса радиомодуля
    getRadioStatus(1);

extitransmit:
//---------------------- В режиме передачи -------------------------------
	if (Radio.TransmitMode) 
    {
      // вначале пересылаем флаг пакета (он уже записан в регистр передачи)
      if(fl_StartPacket) {  
        fl_StartPacket = 0;
        sendData_MRF49XA(RF.TXBREG.HalfWord);
        goto extitransmit;
      } 
      if (RF.STSREG.TXRXFIFO)
      { // Регистр передатчика готов к приёму следующего байта для передачи
        if (Radio.TxCnt >= Radio.TxLen) {
          // Все байты пакета переданы
          // Устанавливаем режим приёма
          setRadioMode(RECEIVE);
          goto exticomplete;
		}

#ifdef BYTESTUFFING // Обработка байтстаффинга на передачу
// При передаче байт 0x7e заменяется на последовательность 0x7d 0x5e
// а байт 0x7d заменяется на последовательность 0x7d 0x5d
        if(fl_ByteStuf) 			
        {	
          fl_ByteStuf = 0;			         // Сбрасываем флаг байтстаффинга
          // Накладываем на передаваемый байт маску XOR                                      
          // Получаем из 0x7e -> 0x5e, из 0x7d -> 0x5d 
          Radio.TxBuf[Radio.TxCnt] ^= 0x20;	 
        } 
        else 
        { 
          if((Radio.TxBuf[Radio.TxCnt] == 0x7e) 
             || (Radio.TxBuf[Radio.TxCnt] == 0x7d))  // если хотим передать байт 0x7e или 0x7d
          {
            fl_ByteStuf = 1;		// Выставляем флаг байстаффинга
            RF.TXBREG.TXDB = 0x7d;	// и подменяем символ на 0x7d
                                    // счётчик байт не меняем 
			sendData_MRF49XA(RF.TXBREG.HalfWord);
            goto extitransmit;		// возврат - берем опять этот же символ
          } 
        }
#endif  // Конец обработки байтстаффинга на передачу

		RF.TXBREG.TXDB = Radio.TxBuf[Radio.TxCnt++];
		sendData_MRF49XA(RF.TXBREG.HalfWord);
      }
      goto extitransmit;
	}

//------------------------ В режиме приёма ---------------------------------
	else if (RF.STSREG.TXRXFIFO) 
    { // Есть принятые данные в FIFO, читаем байт из FIFO
      Bt = readData_MRF49XA();
      if (Radio.Receive) {
        if (Radio.RxCnt >= Radio.RxLen) {
          Radio.Receive = 0;				// Завершаем приём пакета
          Radio.ReceiveComplete = 1;		// Пакет принят
          // Перезапускаем детектор сихропоследовательности
          RF_SYNC_RESTART();
		}
		Radio.RxBuf[Radio.RxCnt++] = Bt;
      } 
      else {
        if (Bt <= DATASIZE) {
          Radio.Receive = 1;				// Устанавливаем флаг приёма пакета
          Radio.RxLen = (uint)Bt + sizeof(PackHeader_TypeDef) + 2;
          Radio.RxCnt = 0;
          Radio.RxBuf[Radio.RxCnt++] = Bt;
		} 
        else {
          // Перезапускаем детектор сихропоследовательности
          RF_SYNC_RESTART();
		}
      }
	}

exticomplete:   // прерывание завершено - пакет передан или принят    

    off (LED);
    // Clear the RF_IRO EXTI line pending bit 
    EXTI_ClearITPendingBit(RF_EXTI_LINE);
  }
*/

/******************* (C) COPYRIGHT 2013 SDK-SYSTEMS *****END OF FILE****/
